Repository: magi1125/inclusive-design-pattern
Catalog: tm/chapter-9_EN-US_JA.tmx
Source language: en_us
Languages: ja

source: For this to work, the fonts will have to be base64-encoded and embedded into the style sheet in question.
ja: そのためには、フォントはBase64でエンコードし、当該のスタイルシートに埋め込む必要があります。

source: In Keith Clark’s example6, <link> has an onload handler which switches the media type from none to all.
ja: キース・クラーク（Keith Clark）の例（脚注9）では、<link>のonloadハンドラでメディアタイプをnoneからallに切り替えています。

source: If JavaScript is entirely unavailable, the CSS is loaded regardless, thanks to <noscript>.
ja: JavaScriptがまったく使えない場合は、<noscript>のおかげで、とにかくCSSが読み込まれます。

source: The base64-encoded font would be included inside an @font-face declaration block, like so:
ja: Base64エンコードのフォントは@font-face宣言ブロックで指定します。

source: A more comprehensive way of overcoming FOIT is offered by Bram Stein7 and requires a small JavaScript dependency.
ja: より包括的なFOIT対策がブラム・スタイン（Bram Stein）の例です。（脚注10）こちらはJavaScriptを少しだけ使います。

source: Font Face Observer allows you to watch and wait on the completion of a font resource loading using a simple promise-based interface:
ja: Font Face Observerを使えば、シンプルなPromiseベースのインターフェイスを用いてフォントリソースの読み込みの経過を監視できます。

source: It’s simple to then supply the font in your CSS, using the .fonts-loaded class selector shown above:
ja: その後、上記のようにCSSで.fonts-loadedクラスセレクタを使ってフォントを指定するだけです。

source: html { /* system font with fallback */ font-family: MySystemSerif, serif; } html.fonts-loaded { /* web font with fallbacks */ font-family: MyWebSerif, MySystemSerif, serif; }
ja: html { /* システムフォントにフォールバック */ font-family: MySystemSerif, serif; } html.fonts-loaded { /* Webフォントにフォールバック */ font-family: MyWebSerif, MySystemSerif, serif; }

source: In defeating FOIT, you have to accept a lesser evil called FOUT (flash of unstyled text).
ja: FOITを使うくらいなら、FOUT（Flash of Unstyled Text）の方がまだましです。

source: This is a rather unjust moniker since all fonts are styled (i.e. they have their own form).
ja: なお、「Flash of Unstyled Text」という名称は理にかなっていません。なぜならすべてのフォントはスタイルを持っている（すなわち独自の様式を持っている）からです。

source: However, there can be an unpleasant and disorienting jump when the web font supplants the system font after it has loaded.
ja: ただし、Webフォントの読み込み後にシステムフォントがWebフォントで置き換えられると、ページの表示位置が突然飛んで、どこを読んでいたか分からなくなってしまう可能性があります。

source: This is due to one font being intrinsically larger or smaller than the other, causing lines to wrap in different places.
ja: これはそもそも片方のフォントがもう片方のフォントより大きかったり小さかったりして、改行位置が変わるためです。

source: To mitigate this undesired effect, your best strategy is to choose fallback system fonts with intrinsic dimensions (metrics) which are similar to the web font.
ja: この望ましくない現象を軽減する一番の方法は、Webフォントと似た？？実寸法？？（メトリクス）のフォールバックシステムフォントを使うことです。【コメント：定訳が確認できませんでした。原文「intrinsic dimensions」】

source: Subsetting Fonts
ja: フォントのサブセット化

source: A font that supports a large, international character set is an inclusive font.
ja: 確かに大きい国際文字セットをサポートしているフォントはインクルーシブなフォントと言えます。

source: Nevertheless, you should only include a subset containing the characters you need or your users may suffer performance issues.
ja: しかし、デザインに必要な文字だけをサブセット化しないと、ユーザー側にパフォーマンスの問題が生じかねません。

source: The difference in file size between an entire font and one subsetted to just the ampersand glyph you want will be many orders of magnitude!
ja: フォント全体のファイルサイズと、必要な文字、たとえばアンパサンド記号（&）のみをサブセット化した場合のファイルサイズは、それこそ桁がいくつも違ってきます。

source: When including fonts using Google Fonts8, you can append a text parameter to the URI listing just the characters you need.
ja: Google Fonts（脚注11）を使用する場合は、URIにtextパラメータを付けて、必要な文字だけをリストして指定できます。

source: For example, if you know your headings will use just the uppercase letters from a particular font, you can include the link like so:
ja: たとえば見出しで特定のフォントの大文字だけを使用したいときは、次のようなリンクを記述します。

source: If you are serving your own fonts, you can first subset them using Font Squirrel’s generator9.
ja: 独自のフォントを使用する場合は、まずFont Squirrelのジェネレータ（脚注12）を使ってフォントをサブセット化します。

source: In the CSS font stack, characters not supported by a priority font are filled by a fallback.
ja: CSSのフォントスタックでは、最優先フォントでサポートされていない文字はフォールバックで対応されます。

source: In practice, this means a well-matched system font can supply the more unusual characters, allowing you to heavily subset the web font.
ja: ？？つまり、最適化されたシステムフォントの方がより多くの特殊文字を使用できるため、その分Webフォントを大幅にサブセット化できるというわけです。？？【コメント：不安訳です。原文「In practice, this means a well-matched system font can supply the more unusual characters, allowing you to heavily subset the web font.」】 ？？

source: By using Font Squirrel’s generator, you can roll back your web font’s character set to just the Basic Latin Unicode block10, for example.
ja: Font Squirrelのジェネレータを使用すれば、独自のWebフォントの文字セットを、たとえば基本ラテン文字のUnicodeブロック（脚注13）のみにロールバックすることも可能です。？？【コメント：不安訳です。原文「Byusing Font Squirrel’s generator, you can roll back your web font’s character set to just the Basic Latin Unicode block,13 for example.」】

source: The <title> Element
ja: <title>要素

source: The <title> element, found in the <head>, should be familiar to you already as the element browsers glean the text from for their tab labeling, and search engines the text for their results links.
ja: 皆さんもよくご存じのとおり、ブラウザのタブのラベルのテキストは<head>の<title>要素から拾われます。また、検索エンジンの検索結果のリンクにも同じテキストが使われます。

source: Certainly, unlabeled browser tabs are a frustrating shortcoming for most anyone, but there are additional implications for assistive technology users.
ja: 確かにタブにラベルがないと、たいていのユーザーはフラストレーションを感じるでしょう。しかし、それだけではありません。支援技術ユーザーにも影響が生じてしまいます。

source: Throughout this book you’ll hear a lot about accessible names.
ja: 本書にはアクセシブルな名前に関する記述がたびたび出てきます。

source: These are the assistive technology compatible labels for the various elements of your web pages.
ja: これはWebページのさまざまな要素の、支援技術対応のラベルのことです。

source: The accessible name for a document, <iframe> or embedded SVG element is provided by their <title>.
ja: ドキュメントや<iframe>や埋め込みのSVG要素の名前は、それぞれの<title>で指定します。

source: It should describe the purpose of the contents of said element.
ja: この名前は、その要素のコンテンツの意図が分かるようなものでなければなりません。

source: The <title> is announced as soon as a new web document is loaded, so it is your opportunity to provide a succinct summary of the page.
ja: <title>は新たにWebドキュメントが読み込まれるとすぐに読み上げられるため、ページの概要を示すのに最適です。

source: Conventional practice is to describe the page and append author and site information.
ja: 一般的にはページの説明に、制作者とサイトの情報を付け加えます。

source: For example, “Inclusive Design Template | Heydon’s Site.” For a search results page, you should include the search term the user provided; something like, “[Website name] | Search results for [search phrase].”
ja: たとえば「インクルーシブデザインテンプレート | ヘイドンのサイト」といった具合です。検索結果のページの場合は、「Webサイト名 | 検索語句の検索結果」のように、ユーザーが入力した検索語句を含めるようにしましょう。

source: The <main> Element
ja: <main>要素

source: Some patterns in this book, like navigation regions, should appear consistently between pages of the site as landmarks.
ja: 本書で扱うパターンのうち、ナビゲーション領域などはサイトの各ページにランドマークとして常に表示させるべきものです。

source: Others will contribute to the modular, often dynamic content that makes up unique pages.
ja: 一方、ページごとのモジュール式のコンテンツ（多くの場合は動的なコンテンツ）に用いられるパターンもあります。

source: In conventional web page anatomy, this content is designated to a main content area.
ja: このようなコンテンツは、慣習的なWebページ構造ではメインコンテンツの領域に割り当てられます。

source: <main id="main"> <!-- this page’s unique content --> </main>
ja: <main id="main"> <!-- このページ独自のコンテンツ --> </main>

source: The concept of main content is not a new one, but it is only recently that we’ve been afforded a tool to inclusively separate it from surrounding page apparatus like headers, navigation regions and footers.
ja: メインコンテンツという考え方自体は新しくはありませんが、メインコンテンツをページの他の要素（ヘッダー、ナビゲーション領域、フッターなど）からインクルーシブに切り離せるようになったのはつい最近のことです。

source: The <main> element defines a region recognized and communicated by screen readers.
ja: スクリーンリーダーは<main>要素で定義された領域を認識して読み上げます。

source: Screen readers like JAWS also offer a keyboard shortcut (the Q key) to access <main>, allowing the user to bypass a page’s preamble and go straight to the content they came for.
ja: また、JAWSなどのスクリーンリーダーには<main>にアクセスするキーボードショートカット（Qキー）も用意されているため、ユーザーはページの前置きは飛ばして目的のコンテンツに直行できます。

source: In a single-page application, your singular <main> should be where each of your functionality-heavy views is rendered.
ja: シングルページアプリケーションの場合は、1つの<main>でさまざまな機能が盛り込まれた各ビューを描画しなければなりません。

source: In a static blog or brochure website, <main> would contain blog posts and other informational content.
ja: 静的なブログや？？ブローシャサイト？？の<main>には、ブログのポストやその他の情報コンテンツが含まれます。【コメント：定訳が確認できませんでした。原文「brochure website」】

source: A products page would describe the products within <main>.
ja: また製品のページの場合は、この<main>で製品説明を行います。

source: Since <main> is designed to contain the salient content of a page, it can make the writing of a print style sheet easier.
ja: <main>はページの主要なコンテンツを入れるようにデザインされているため、印刷用のスタイルシートの作成が楽になります。

source: If your navigation, header, footer and sidebar (<aside>) regions are correctly made the siblings of <main>, you can target them quite easily with CSS:
ja: ナビゲーション、ヘッダー、フッター、サイドバー（<aside>）の領域がきちんと<main>の兄弟になっていれば、CSSでそれらをターゲットに指定するのは非常に簡単です。

source: I’m not one to print web pages.
ja: 私はWebページの印刷はしません。

source: I gave up on home printers a long time ago because they always seemed to break after ten minutes of use.
ja: 10分も使うと必ず壊れるような家庭用プリンターには、とうの昔に見切りをつけました。

source: But not everyone is like me, and making sure printed pages do not contain page elements which are only relevant when browsing on-screen is an act of considerate, inclusive design.
ja: しかし皆がそうとは限りません。したがって、印刷用のページには画面で見ないと意味をなさないページ要素は含めない方が親切かつインクルーシなブデザインと言えます。

source: It’s currently the easiest offline solution available, because it means the reader can print to PDF and save to their local drive.
ja: それならPDFにプリントしてローカルディスクに保存することもできるため、オフラインの解決策としては、これが現時点で一番簡単です。

source: Box labeled ‘The important stuff’ surrounded by grayed out subsidiary boxes
ja: 重要な部分

source: Another advantage of being able to eliminate subsidiary content is the ability to improve the on-screen reading experience.
ja: 補助的なコンテンツを省けるようにするもう一つのメリットは、画面で読むユーザーの体験が向上するということです。

source: Extensions are available11 to apply your own CSS on a per-domain basis.
ja: 拡張機能（脚注14）を使えばオリジナルのCSSをドメインベースで適用できます。

source: Skip Links
ja: スキップリンク

source: Skip links are a classic allowance made in the name of inclusive design: they feel like an awful cludge, but their impact on the experience of some types of users is tried and tested.
ja: スキップリンクは、インクルーシブデザインで考慮される典型的なものです。その場しのぎの解決策に思えるかもしれませんが、スキップリンクが一部のユーザーの体験に及ぼす効果は実証済みです。

source: A skip link appears above all other content on the page and points to the main content area.
ja: スキップリンクはページの一番上に表示され、そこからメインコンテンツ領域にジャンプすることができます。

source: But who’s it for?
ja: では、スキップリンクはいったい誰のためのものでしょう？

source: Conventional wisdom says screen reader users but, as I’ve already covered, they have other means to reach the <main> element.
ja: 一般的な答えは「スクリーンリーダーユーザーのため」でしょう。しかし、前述したように、スクリーンリーダーユーザーが<main>要素に移動する手段は他にもあります。

source: The principal beneficiaries of skip links are sighted keyboard users.
ja: スキップリンクの恩恵を最も受けるのは、晴眼のキーボードユーザーです。

source: Such people are not afforded the same shortcuts as screen reader operators, so it’s them we’re mostly helping to skip over navigation and other header content.
ja: スクリーンリーダーのようなショートカットが使えないキーボードユーザーこそ、ナビゲーションや他のヘッダーコンテンツを飛ばしてすぐにメインコンテンツを読むことができるスキップリンクを一番活用できるというわけです。

source: Skip links should not appear visually by default because they have very limited utility to mouse and touch users and would only serve to confound them.
ja: ただし、スキップリンクはデフォルトでは表示されないようにすべきです。マウスユーザーやタッチユーザーにとっては非常に使いにくく、混乱を招くだけだからです。

source: To make skip links available to keyboard users, we should bring them into view on focus:
ja: キーボードユーザーがスキップリンクを利用できるように、フォーカスされたときだけ表示されるようにすることをお勧めします。

source: [href="#main"] { position: absolute; top: 0; right: 100%; /* moves off screen */ } [href="#main"]:focus { right: auto; }
ja: [href=”#main”] { position: absolute; top: 0; right: 100%; /* 画面外に移動*/ } [href=”#main”]:focus { right: auto; }

source: When a keyboard user enters a new page, the document itself will be the first thing to receive focus.
ja: キーボードユーザーが新しいページに移動すると、まずそのドキュメントがフォーカスを受け取ります。

source: With the above provision in place, when the user hits their Tab key they’ll focus the first interactive element on the page: the skip link.
ja: その状態でユーザーがTabキーを押すと、ページ内の最初のインタラクティブ要素、つまりスキップリンクがフォーカスされます。

source: Focusing the skip link reveals it visually, giving the user the option of skipping to the main content if so desired.
ja: その時点でスキップリンクが画面に表示され、ユーザーは必要に応じてメインコンテンツにジャンプできるようになります。

source: Tabbing again will hide the skip link and focus on the next interactive element on the page (probably the homepage link or the first link in the navigation list).
ja: そしてもう一度Tabキーを押すとスキップリンクは非表示になり、ページ内の次のインタラクティブ要素（たいていはホームページへのリンクやナビゲーションリストの最初のリンク）にフォーカスが移ります。

source: Putting The Page Together
ja: ページを作ってみよう

source: OK, let’s see how our inclusive document is shaping up.
ja: では実際にインクルーシブなドキュメントを作ってみましょう。

source: <!DOCTYPE html> <!-- the main language of the page declared --> <html lang="en"> <head> <meta charset="utf-8"> <!-- a viewport declaration which does not disable zooming --> <meta name="viewport" content="width=device-width, initial-scale=1.0"> <!-- a non-blocking base64 encoded font resource --> <link rel="stylesheet" href="fonts.css" media="none" onload="if(media!='all')media='all'"> <noscript><link rel="stylesheet" href="fonts.css"></noscript> <!-- a non-blocking stylesheet --> <link rel="stylesheet" href="main.css" media="none" onload="if(media!='all')media='all'"> <noscript><link rel="stylesheet" href="main.css"></noscript> <!-- a descriptive label for the page --> <title>Inclusive Design Template | Heydon’s Site</title> </head> <body> <!-- a handy skip link for keyboard users --> <a href="#main">skip to main content</a> <!-- logo / page navigation etc. goes here --> <main id="main"> <!-- unique content of page goes here --> </main> <!-- a non-blocking javascript resource --> <script src="scripts.js"></script> </body> </html>
ja: <!DOCTYPE html> <!-- ページのメインの言語を指定 --> <html lang="en"> <head> <meta charset="utf-8"> <!-- ズームを無効にしないビューポート宣言 --> <meta name="viewport" content="width=device-width, initial-scale=1.0"> <!-- ？？ノンブロッキングの？？Base64エンコードのフォントリソース -->【コメント：不安訳です。原文「a non-blocking」複数あります】 <link rel="stylesheet" href="fonts.css" media="none" onload="if(media!='all')media='all'"> <noscript><link rel="stylesheet" href="fonts.css"></noscript> <!-- ？？ノンブロッキングの？？スタイルシート -->【コメント：同上】 <link rel="stylesheet" href="main.css" media="none" onload="if(media!='all')media='all'"> <noscript><link rel="stylesheet" href="main.css"></noscript> <!-- ページの内容が分かるようなラベル --> <title>インクルーシブデザインテンプレート| ヘイドンのサイト</title> </head> <body> <!-- キーボードユーザーに便利なスキップリンク --> <a href="#main">メインコンテンツにジャンプ</a> <!-- ロゴやページナビゲーションはここに --> <main id="main"> <!-- このページ独自のコンテンツはここに --> </main> <!-- ？？ノンブロッキングの？？JavaScriptリソース -->【コメント：同上】 <script src="scripts.js"></script> </body> </html>

source: A Note On Frameworks, Preprocessors And Task Runners
ja: フレームワーク、プリプロセッサ、タスクランナーについて

source: “It seems to me that developer ergonomics should be less important than our users’ needs.” – Paul Lewis12
ja: ？？開発者のための人間工学？？よりもユーザーのニーズの方が重要だと私は思う。【コメント：定訳が確認できませんでした。原文「developer ergonomics」】 — ポール・ルイス（Paul Lewis）（脚注15）

source: A lot of web design articles and books are about improving your workflow and making your life easier as a developer.
ja: Webデザイン関連の記事や本には、ワークフローの改善や、開発者側が楽をするための方法が書かれたものがたくさんあります。

source: Should you wish to adopt a framework or employ a preprocessor to speed up your development process, be my guest.
ja: 皆さんの中にもフレームワークやプリプロセッサを利用して開発プロセスのスピードアップを図りたいと思う人はいるでしょう。

source: However, this book is not about you; it’s about your audience.
ja: しかし、本書は開発者のための本ではなく、ユーザーのための本です。

source: As such, any time spent on tools will only be in cases where they can have a direct impact on the quality of the user experience.
ja: そのため、ユーザーの体験をダイレクトに向上させることができるツールにのみ時間を割いていきます。

source: Under all other circumstances we’ll be exploring the possibilities offered by standard web technologies like HTML, CSS, JavaScript and SVG.
ja: あらゆる状況を想定して、HTML、CSS、JavaScript、SVGといった一般的なWeb技術の可能性を探りましょう。

source: How these underlying technologies actually interact with your users will be the focus throughout (alongside organizational and writing techniques that benefit users too, of course).
ja: こうした基本的な技術をユーザーが実際にどのように利用することになるのか。それを常に考えなければなりません（もちろん、ユーザーにメリットのある構成や記述のテクニックも大切です）。

source: You can take the lessons learned here and apply them within any framework sufficiently flexible to allow you to write and organize good interfaces.
ja: ここで学んだことを生かしながら、十分に柔軟なフレームワークを利用すれば、優れたインターフェイスを記述、編成できます。

source: Any opinionated frameworks not easily configurable for inclusive design techniques should be avoided.
ja: インクルーシブデザインの技術に合うように簡単に調整できないような頑固なフレームワークは避けるべきです。

source: They lead you to build poor products.
ja: それでは良いデザインは作れません。

source: To help me stay focused on the true task at hand, I have a points system.
ja: 目の前の重要な課題に集中するために、私はポイント制を採用しています。

source: In all cases, whether I’m applying visual design, writing JavaScript behavior or structuring content, I ask who benefits from the way I’m approaching it.
ja: 視覚的なデザインに取り組むときも、JavaScriptの動作を記述するときも、コンテンツを構築するときも、私は必ず、そのやり方で恩恵を受けるのは誰かを考えます。

source: •1 point: it benefits me
ja: • 1ポイント：自分

source: •10 points: it benefits a user/reader like me and with my setup
ja: • 10ポイント：自分と似た（つまり自分と同じような状況の）ユーザー

source: •100 points: it benefits me, people like me, and users/readers unlike me, with differing setups
ja: • 100ポイント：自分、自分と似たユーザー、および自分とは違う（つまり自分とは状況が異なる）ユーザー

source: One hundred points is what we’re aiming for here.
ja: 目指すは100ポイントです！

source: 1.https://developer.mozilla.org/en-US/docs/Quirks_Mode_and_Standards_Mode 2.https://cloud.google.com/translate/docs 3.https://developer.mozilla.org/en/docs/Tools/Responsive_Design_Mode 4.http://adrianroselli.com/2015/10/dont-disable-zoom.html 5.http://zellwk.com/blog/media-query-units/ 6.http://keithclark.co.uk/articles/loading-css-without-blocking-render/ 7.https://github.com/bramstein/fontfaceobserver 8.https://www.google.com/fonts 9.http://www.fontsquirrel.com/tools/webfont-generator 10.https://en.wikipedia.org/wiki/Basic_Latin_(Unicode_block) 11.https://chrome.google.com/webstore/detail/stylish/fjnbnpbmkenffdnngjfgmeleoegfcffe?hl=en 12.https://aerotwist.com/blog/react-plus-performance-equals-what/
ja: 4 http://smashed.by/quirksmode 5 https://cloud.google.com/translate/docs 6 http://smashed.by/rdmode 7 http://adrianroselli.com/2015/10/dont-disable-zoom.html 8 http://zellwk.com/blog/media-query-units/ 9 http://smashed.by/render-block 10 https://github.com/bramstein/fontfaceobserver 11 https://www.google.com/fonts 12 http://www.fontsquirrel.com/tools/webfont-generator 13 https://en.wikipedia.org/wiki/Basic_Latin_(Unicode_block) 14 http://smashed.by/stylish 15 https://aerotwist.com/blog/react-plus-performance-equals-what/
